---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewElementSet
source: html/10670292-3207-e40d-ae11-fe24cdd63cef.htm
---
# Autodesk.Revit.Creation.Application.NewElementSet Method

Creates a new instance of a set specifically for holding elements.

## Syntax (C#)
```csharp
public ElementSet NewElementSet()
```

## Returns
A new Element Set.

## Remarks
This is a general purpose set for passing elements to and from methods.